samples/PullPointSubscriptionBinding.CreatePullPointSubscription.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
    xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:chan="http://schemas.microsoft.com/ws/2005/02/duplex"
    xmlns:wsa5="http://www.w3.org/2005/08/addressing"
    xmlns:wsrfbf="http://docs.oasis-open.org/wsrf/bf-2"
    xmlns:wstop="http://docs.oasis-open.org/wsn/t-1"
    xmlns:wsrfr="http://docs.oasis-open.org/wsrf/r-2"
    xmlns:tev="http://www.onvif.org/ver10/events/wsdl"
    xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2">
 <SOAP-ENV:Header>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <tev:CreatePullPointSubscription>
    <tev:Filter>
     <!-- extensibility element(s) -->
    </tev:Filter>
    <tev:InitialTerminationTime></tev:InitialTerminationTime>
    <tev:SubscriptionPolicy>
     <!-- extensibility element(s) -->
    </tev:SubscriptionPolicy>
    <!-- extensibility element(s) -->
   </tev:CreatePullPointSubscription>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
